/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cub3d_loop.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dongwook <dongwook@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/09 22:50:40 by dongwook          #+#    #+#             */
/*   Updated: 2024/08/09 22:56:24 by dongwook         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3d.h"

int cub3d_loop(t_data *data)
{
    // calc(data); -> 08.09 이 함수 쪼개기, 다 만들고 Makefile 다시
	// draw(data);
    return (TRUE);
}